import React, { useState, useEffect } from "react";
import { Link } from "react-router-dom";
import logoImg from "../assets/Combined Shape.png";
import ImgPets from "../assets/image.png";
import ManDog from "../assets/image@2x.png";
import Dog from "../assets/image@3x (1).png";
import Carrot from "../assets/img.png";
import Cat from "../assets/cat.png";
import "./All.css";

import {
  Clock,
  List,
  Award,
  Beaker,
  HomeIcon,
  Monitor,
  Calendar,
  ShoppingBag,
  Scissors,
  Stethoscope,
  Brain,
  Bone,
  PawPrint,
  Eye,
  BookOpen,
  Baby,
  Camera,
  FlaskConical,
  Syringe,
  Landmark,
  PenTool,
  Pill,
  Paintbrush,
  Heart,
} from "lucide-react";

function WhyChooseUs() {
  const [hoveredFeature, setHoveredFeature] = useState(null);
  const features = [
    {
      id: 1,
      icon: <Clock size={42} />,
      title: "Работаем круглосуточно",
      description:
        "Мы готовы в любое время суток принять домашних питомцев и их хозяев",
    },
    {
      id: 2,
      icon: <List size={42} />,
      title: "Широкий спектр услуг",
      description:
        "Кроме широкопрофильных докторов в клинике развиты узкие направления в ветеринарии",
    },
    {
      id: 3,
      icon: <Award size={42} />,
      title: "Большой опыт",
      description:
        "30 высококвалифицированных врачей нашей клиники работают уже 18 лет!",
    },
    {
      id: 4,
      icon: <Beaker size={42} />,
      title: "Собственная лаборатория",
      description:
        "Оборудованная профессиональным оснащением для быстрого анализа",
    },
    {
      id: 5,
      icon: <HomeIcon size={42} />,
      title: "Оснащенные стационары",
      description:
        "Обычный и инфекционный стационар с подогревом и кислородными камерами",
    },
    {
      id: 6,
      icon: <Monitor size={42} />,
      title: "Новейшее оборудование",
      description: "Современный эндоскоп KARL STORZ и цифровой рентген",
    },
    {
      id: 7,
      icon: <Calendar size={42} />,
      title: "Запись на прием онлайн",
      description: "Запись онлайн или вызов на дом",
    },
    {
      id: 8,
      icon: <ShoppingBag size={42} />,
      title: "Аптека и зоомагазин",
      description: "Аптека и бутик с одеждой и косметикой для питомцев",
    },
    {
      id: 9,
      icon: <Scissors size={42} />,
      title: "Груминг-салон",
      description: "Гигиенические и косметические процедуры для питомцев",
    },
  ];

  return (
    <div className="why-choose-us-container">
      <h2 className="why-choose-us-title">Почему хозяева выбирают нас?</h2>
      <div className="features-grid">
        {features.map((feature) => (
          <div
            key={feature.id}
            className={`feature-card ${
              hoveredFeature === feature.id ? "hovered" : ""
            }`}
            onMouseEnter={() => setHoveredFeature(feature.id)}
            onMouseLeave={() => setHoveredFeature(null)}
          >
            <div className="feature-content">
              <div
                className={`feature-icon ${
                  hoveredFeature === feature.id ? "icon-hovered" : ""
                }`}
              >
                {feature.icon}
              </div>
              <h3 className="feature-title">{feature.title}</h3>
              <p className="feature-description">{feature.description}</p>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
}

function MedicalServices() {
  const [hoveredCard, setHoveredCard] = useState(null);
  const [selectedService, setSelectedService] = useState({});

  // Define unique services for each medical category
  const serviceDetails = {
    Терапия: [
      "Общий осмотр",
      "Вакцинация",
      "Дегельминтизация",
      "Лечение инфекций",
      "Антипаразитарная обработка",
      "Консультация терапевта",
      "Лечение ОРВИ",
      "Диагностика аллергий",
      "Лечение дерматитов",
      "УЗИ диагностика",
      "Лечение гастрита",
      "ЭКГ",
      "Лечение цистита",
      "Мониторинг хронических заболеваний",
      "Лечение отитов",
      "Профилактические осмотры",
      "Лечение конъюнктивита",
      "Терапия ожирения",
      "Лечение диареи",
      "Контроль диабета",
      "Лечение заболеваний почек",
      "Терапия артрита",
      "Лечение анемии",
      "Диагностика инфекций",
      "Лечение пневмонии",
      "Консультация по питанию",
    ],
    Хирургия: [
      "Стерилизация",
      "Кастрация",
      "Удаление опухолей",
      "Операции на суставах",
      "Хирургия мягких тканей",
      "Остеосинтез",
      "Удаление инородных тел",
      "Лечение грыж",
      "Хирургия глаз",
      "Ампутация конечностей",
      "Лечение абсцессов",
      "Хирургия ушей",
      "Лапаротомия",
      "Торакотомия",
      "Хирургия мочевого пузыря",
      "Удаление зубов",
      "Лечение переломов",
      "Хирургия кишечника",
      "Биопсия тканей",
      "Лечение ран",
      "Удаление когтей",
      "Хирургия печени",
      "Лечение вывихов",
      "Хирургия селезенки",
      "Экстренная хирургия",
      "Пластическая хирургия",
    ],
    Неврология: [
      "Диагностика эпилепсии",
      "Лечение судорог",
      "МРТ головного мозга",
      "Лечение инсультов",
      "Диагностика невритов",
      "Лечение параличей",
      "ЭЭГ",
      "Лечение вестибулярных нарушений",
      "Диагностика опухолей мозга",
      "Лечение менингита",
      "Реабилитация после травм",
      "Лечение невропатий",
      "Диагностика спинальных травм",
      "Лечение тремора",
      "Консультация невролога",
      "Лечение атаксии",
      "Диагностика гидроцефалии",
      "Лечение миастении",
      "Терапия болевых синдромов",
      "Лечение радикулита",
      "Диагностика деменции",
      "Лечение нарушений координации",
      "Терапия нейропатий",
      "Лечение нервных тиков",
      "Диагностика нарушений сна",
      "Лечение посттравматических расстройств",
    ],
    Ортопедия: [
      "Лечение переломов",
      "Коррекция дисплазии",
      "Лечение артроза",
      "Операции на суставах",
      "Протезирование",
      "Лечение вывихов",
      "Диагностика остеомиелита",
      "Лечение остеохондроза",
      "Реабилитация после травм",
      "Лечение растяжений",
      "Диагностика артрита",
      "Лечение бурсита",
      "Остеосинтез",
      "Лечение деформаций костей",
      "Консультация ортопеда",
      "Лечение хромоты",
      "Диагностика патологий связок",
      "Лечение тендинита",
      "Операции на позвоночнике",
      "Лечение сколиоза",
      "Диагностика остеопороза",
      "Лечение пателлярного вывиха",
      "Терапия болей в суставах",
      "Лечение костных инфекций",
      "Диагностика аномалий роста",
      "Лечение дегенеративных заболеваний",
    ],
    Офтальмология: [
      "Диагностика катаракты",
      "Лечение глаукомы",
      "Операции на роговице",
      "Лечение конъюнктивита",
      "Диагностика увеита",
      "Лечение кератита",
      "Операции на веках",
      "Диагностика ретинопатии",
      "Лечение язв роговицы",
      "Консультация офтальмолога",
      "Лечение блефарита",
      "Диагностика слепоты",
      "Лечение энтропиона",
      "Терапия сухого глаза",
      "Лечение экзофтальма",
      "Диагностика аномалий век",
      "Ультразвуковое исследование глаз",
      "Лечение дакриоцистита",
      "Операции на сетчатке",
      "Лечение травм глаз",
      "Диагностика астигматизма",
      "Лечение инфекций глаз",
      "Терапия аллергических реакций",
      "Лечение прогрессирующей атрофии",
      "Диагностика опухолей глаз",
      "Лечение косоглазия",
    ],
    Кардиология: [
      "ЭКГ",
      "Эхокардиография",
      "Лечение аритмий",
      "Диагностика пороков сердца",
      "Лечение гипертензии",
      "Консультация кардиолога",
      "Лечение кардиомиопатии",
      "Диагностика сердечной недостаточности",
      "Мониторинг давления",
      "Лечение эндокардита",
      "Диагностика тромбоэмболии",
      "Лечение перикардита",
      "Терапия тахикардии",
      "Лечение брадикардии",
      "Диагностика аневризм",
      "Лечение миокардита",
      "Мониторинг сердечного ритма",
      "Лечение врожденных пороков",
      "Диагностика стеноза",
      "Лечение коллапса",
      "Терапия отеков",
      "Лечение гипертрофии",
      "Диагностика шумов в сердце",
      "Лечение сердечных блокад",
      "Терапия хронических заболеваний",
      "Контроль сердечной активности",
    ],
    Стоматология: [
      "Удаление зубов",
      "Чистка зубов",
      "Лечение кариеса",
      "Диагностика пародонтита",
      "Лечение гингивита",
      "Консультация стоматолога",
      "Удаление зубного камня",
      "Лечение стоматита",
      "Рентген зубов",
      "Лечение абсцессов",
      "Протезирование зубов",
      "Лечение переломов зубов",
      "Диагностика опухолей полости рта",
      "Лечение язв",
      "Терапия инфекций",
      "Лечение аномалий прикуса",
      "Удаление кист",
      "Лечение травм десен",
      "Диагностика резорбции зубов",
      "Лечение воспалений",
      "Терапия болевых синдромов",
      "Лечение флюса",
      "Диагностика аномалий роста",
      "Лечение кровоточивости десен",
      "Терапия аллергических реакций",
      "Контроль гигиены полости рта",
    ],
    Репродуктология: [
      "Искусственное осеменение",
      "Диагностика бесплодия",
      "Консультация репродуктолога",
      "Лечение гормональных нарушений",
      "УЗИ репродуктивных органов",
      "Диагностика инфекций",
      "Лечение эндометрита",
      "Контроль беременности",
      "Кесарево сечение",
      "Лечение мастита",
      "Диагностика аномалий",
      "Лечение пиометры",
      "Терапия выкидышей",
      "Контроль лактации",
      "Лечение вульвовагинита",
      "Диагностика опухолей",
      "Лечение простатита",
      "Терапия орхита",
      "Контроль фертильности",
      "Лечение кист яичников",
      "Диагностика гормональных сбоев",
      "Лечение нарушений цикла",
      "Терапия ложной беременности",
      "Контроль послеродового периода",
      "Лечение воспалений",
      "Диагностика врожденных аномалий",
    ],
    "Визуальная диагностика": [
      "УЗИ",
      "Рентген",
      "МРТ",
      "КТ",
      "Эндоскопия",
      "Эхокардиография",
      "Диагностика опухолей",
      "Рентген костей",
      "УЗИ брюшной полости",
      "Диагностика переломов",
      "КТ головного мозга",
      "Эндоскопия ЖКТ",
      "УЗИ сердца",
      "Рентген легких",
      "Диагностика инородных тел",
      "МРТ позвоночника",
      "КТ суставов",
      "Эндоскопия дыхательных путей",
      "УЗИ почек",
      "Рентген черепа",
      "Диагностика грыж",
      "МРТ мягких тканей",
      "КТ органов грудной клетки",
      "Эндоскопия мочевого пузыря",
      "УЗИ печени",
      "Диагностика аномалий",
    ],
    Лаборатория: [
      "Общий анализ крови",
      "Биохимический анализ",
      "Анализ мочи",
      "Анализ кала",
      "Гормональный анализ",
      "Бактериологический посев",
      "ПЦР-диагностика",
      "Анализ на паразитов",
      "Иммунологический анализ",
      "Гистология",
      "Цитология",
      "Анализ на инфекции",
      "Тест на аллергии",
      "Анализ на вирусы",
      "Диагностика диабета",
      "Анализ на онкомаркеры",
      "Тест на антитела",
      "Анализ ликвора",
      "Диагностика анемии",
      "Анализ на свертываемость",
      "Тест на токсины",
      "Анализ на микроэлементы",
      "Диагностика заболеваний печени",
      "Анализ на электролиты",
      "Тест на грибки",
      "Контроль метаболизма",
    ],
    Онкология: [
      "Диагностика опухолей",
      "Биопсия",
      "Химиотерапия",
      "Лечение лимфомы",
      "Диагностика саркомы",
      "Консультация онколога",
      "Удаление опухолей",
      "Радиотерапия",
      "Лечение меланомы",
      "Диагностика метастазов",
      "Терапия рака молочной железы",
      "Лечение лейкоза",
      "Диагностика карциномы",
      "Паллиативная терапия",
      "Лечение остеосаркомы",
      "Диагностика опухолей кожи",
      "Терапия рака легких",
      "Лечение опухолей печени",
      "Диагностика нейроэндокринных опухолей",
      "Контроль ремиссии",
      "Лечение опухолей мозга",
      "Терапия рака костей",
      "Диагностика опухолей мочевого пузыря",
      "Лечение рака кишечника",
      "Терапия рака поджелудочной железы",
      "Контроль побочных эффектов",
    ],
    Эндокринология: [
      "Диагностика диабета",
      "Лечение гипотиреоза",
      "Консультация эндокринолога",
      "Диагностика гипертиреоза",
      "Лечение болезни Кушинга",
      "Контроль гормонов",
      "Диагностика аддисоновой болезни",
      "Лечение ожирения",
      "Терапия гиперпаратиреоза",
      "Диагностика гипопаратиреоза",
      "Лечение гипогликемии",
      "Контроль метаболизма",
      "Диагностика акромегалии",
      "Лечение гиперплазии надпочечников",
      "Терапия гипофиза",
      "Диагностика гормональных сбоев",
      "Лечение нарушений роста",
      "Контроль уровня кортизола",
      "Диагностика тиреоидита",
      "Лечение нарушений обмена",
      "Терапия гормонозависимых опухолей",
      "Диагностика инсулиномы",
      "Лечение гиперкальциемии",
      "Контроль уровня инсулина",
      "Диагностика нарушений полового созревания",
      "Лечение поликистоза",
    ],
    "Экзотические животные": [
      "Лечение рептилий",
      "Консультация по птицам",
      "Диагностика заболеваний рыб",
      "Лечение грызунов",
      "Терапия амфибий",
      "Контроль питания экзотов",
      "Лечение хорьков",
      "Диагностика паразитов",
      "Лечение кроликов",
      "Терапия ежей",
      "Консультация по шиншиллам",
      "Лечение игуан",
      "Диагностика инфекций",
      "Лечение черепах",
      "Терапия змей",
      "Контроль террариумных условий",
      "Лечение попугаев",
      "Диагностика аномалий",
      "Лечение морских свинок",
      "Терапия хамелеонов",
      "Консультация по скунсам",
      "Лечение сахарных поссумов",
      "Диагностика метаболических нарушений",
      "Лечение мини-пигов",
      "Терапия паукообразных",
      "Контроль репродукции",
    ],
    Аптека: [
      "Продажа антибиотиков",
      "Противопаразитарные препараты",
      "Витамины для животных",
      "Препараты для суставов",
      "Лекарства для сердца",
      "Противовоспалительные средства",
      "Гормональные препараты",
      "Антигистаминные средства",
      "Препараты для глаз",
      "Лекарства для ушей",
      "Средства для кожи",
      "Препараты для ЖКТ",
      "Обезболивающие",
      "Седативные препараты",
      "Противогрибковые средства",
      "Лекарства для почек",
      "Препараты для печени",
      "Иммуномодуляторы",
      "Противовирусные средства",
      "Средства для дыхательной системы",
      "Препараты для репродукции",
      "Лекарства для мочевой системы",
      "Средства для нервной системы",
      "Препараты для эндокринной системы",
      "Лекарства для онкологии",
      "Консультация фармацевта",
    ],
    Груминг: [
      "Стрижка шерсти",
      "Мытье животных",
      "Чистка ушей",
      "Стрижка когтей",
      "Вычесывание колтунов",
      "Гигиеническая стрижка",
      "Тримминг",
      "Чистка зубов",
      "Экспресс-линька",
      "Уход за глазами",
      "Стрижка морды",
      "Уход за лапами",
      "Покраска шерсти",
      "Массаж кожи",
      "Ароматерапия",
      "Уход за хвостом",
      "Стрижка для выставок",
      "Чистка параанальных желез",
      "Уход за шерстью длинношерстных",
      "Спа-процедуры",
      "Антипаразитарная обработка",
      "Уход за шерстью короткошерстных",
      "Маски для шерсти",
      "Уход за кожей",
      "Консультация грумера",
      "Подбор косметики",
    ],
  };

  const services = [
    {
      id: 1,
      name: "Терапия",
      icon: <Stethoscope size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 2,
      name: "Хирургия",
      icon: <Scissors size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 3,
      name: "Неврология",
      icon: <Brain size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 4,
      name: "Ортопедия",
      icon: <Bone size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 6,
      name: "Офтальмология",
      icon: <Eye size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 7,
      name: "Кардиология",
      icon: <Heart size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 8,
      name: "Стоматология",
      icon: <BookOpen size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 9,
      name: "Репродуктология",
      icon: <Baby size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 10,
      name: "Визуальная диагностика",
      icon: <Camera size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 11,
      name: "Лаборатория",
      icon: <FlaskConical size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 12,
      name: "Онкология",
      icon: <Syringe size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 13,
      name: "Эндокринология",
      icon: <Landmark size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 14,
      name: "Экзотические животные",
      icon: <PenTool size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 15,
      name: "Аптека",
      icon: <Pill size={32} />,
      services: 26,
      link: "/write",
    },
    {
      id: 16,
      name: "Груминг",
      icon: <Paintbrush size={32} />,
      services: 26,
      link: "/write",
    },
  ];

  const handleServiceSelect = (serviceId, value) => {
    setSelectedService((prev) => ({
      ...prev,
      [serviceId]: value,
    }));
    // Сохраняем выбранную услугу в localStorage
    localStorage.setItem("selectedServiceDetail", value);
  };

  return (
    <div className="medical-services-container">
      <h2 className="services-title">Наши услуги</h2>
      <div className="services-grid">
        {services.map((service) => (
          <div
            key={service.id}
            className={`service-card ${
              hoveredCard === service.id ? "hovered" : ""
            }`}
            onMouseEnter={() => setHoveredCard(service.id)}
            onMouseLeave={() => setHoveredCard(null)}
          >
            <h3 className="service-title">{service.name}</h3>
            <div
              className={`service-icon ${
                hoveredCard === service.id ? "icon-hovered" : ""
              }`}
            >
              {service.icon}
            </div>
            <p className="service-count">{service.services} услуг</p>
            <select
              className="service-dropdown"
              value={selectedService[service.id] || ""}
              onChange={(e) => handleServiceSelect(service.id, e.target.value)}
            >
              <option value="" disabled>
                Выберите услугу
              </option>
              {serviceDetails[service.name].map((detail, index) => (
                <option key={index} value={detail}>
                  {detail}
                </option>
              ))}
            </select>
            <Link to="/write" className="service-book-btn">
              Записаться
            </Link>
          </div>
        ))}
      </div>
    </div>
  );
}

function ContactSection() {
  return (
    <div className="contact-container">
      <div className="contact-wrapper">
        <div className="contact-info">
          <div className="contact-address">
            <h3>Айболит на Краснополянской</h3>
            <p>Дзержинский район, ул. Краснополянская, 30</p>
            <p>Тел: 96 22 92</p>
            <p>Круглосуточно</p>
          </div>
          <div className="contact-address">
            <h3>Айболит на Тульской</h3>
            <p>Советский район, ул. Карла Маркса, 7</p>
            <p>Тел: 96 22 92</p>
            <p>Круглосуточно</p>
          </div>
        </div>
        <div className="map-container">
          <iframe
            title="Clinic Map"
            src="https://www.google.com/maps/embed?..."
            allowFullScreen=""
            loading="lazy"
          ></iframe>
        </div>
      </div>
    </div>
  );
}

function HomePage() {
  const [activeSlide, setActiveSlide] = useState(1);
  const [menuOpen, setMenuOpen] = useState(false);
const [slideFade, setSlideFade] = useState(true);

useEffect(() => {
  const timer = setInterval(() => {
    setSlideFade(false); // Начать исчезновение
    setTimeout(() => {
      setActiveSlide((prev) => (prev < 4 ? prev + 1 : 1));
      setSlideFade(true); // Плавное появление
    }, 300); 
  }, 3000);

  return () => clearInterval(timer);
}, []);

  const slides = {
    1: {
      title: "Айболит\nкруглосуточная\nветклиника",
      buttonText: "Записаться",
      img: ImgPets,
      link: "/write",
    },
    2: {
      title: "Профессиональные\nврачи",
      buttonText: "Подробнее",
      img: ManDog,
      link: "/collective",
    },
    3: {
      title: "Скидки и акции\nдля постоянных\nклиентов",
      buttonText: "Узнать больше",
      img: Carrot,
      link: "/share",
    },
    4: {
      title: "Профессиональные\nветврачи\nи оборудование",
      buttonText: "Записаться",
      img: Cat,
      link: "/write",
    },
  };

  const currentSlide = slides[activeSlide];

  return (
    <div className="app">
      <header className="header">
        <Link to="/">
          <img className="logo" src={logoImg} alt="pets" />
        </Link>
        <button
          className="burger-menu"
          onClick={() => setMenuOpen(!menuOpen)}
          aria-label="Toggle menu"
        >
          ☰
        </button>
        <nav>
          <Link to="/">Главная</Link>
          <div className="dropdown">
            <Link to="/" className="dropdown-toggle">
              О нас
            </Link>
            <div className="dropdown-menu">
              <Link to="/collective">Коллектив</Link>
              <Link to="/history">История компании</Link>
            </div>
          </div>
          <Link to="/contacts">Контакты</Link>
          <Link to="/blog">Блог</Link>
        </nav>
      </header>

      <aside className={`side-menu ${menuOpen ? "open" : ""}`}>
        <button
          className="close-menu"
          onClick={() => setMenuOpen(false)}
          aria-label="Close menu"
        >
          ✖
        </button>
        <nav>
          <Link to="/">Главная</Link>
          <Link to="/history">О нас</Link>
          <Link to="/contacts">Контакты</Link>
          <Link to="/blog">Блог</Link>
        </nav>
      </aside>

      <div className="content">
        <div className="side-nav">
          {[1, 2, 3, 4].map((num) => (
            <button
              key={num}
              className={activeSlide === num ? "active" : ""}
              onClick={() => setActiveSlide(num)}
            >
              {num}
            </button>
          ))}
        </div>
        <div className="main">
          <h1 className="ai">
            {currentSlide.title.split("\n").map((line, idx) => (
              <React.Fragment key={idx}>
                {line}
                <br />
              </React.Fragment>
            ))}
          </h1>
          <Link to={currentSlide.link} className="main-btn">
            {currentSlide.buttonText}
          </Link>
          
          <img src={currentSlide.img} alt="slide" className="main-img" />
        </div>
      </div>

      <WhyChooseUs />
      <MedicalServices />
      <ContactSection />

      <footer className="footer">
        <div className="footer-content">
          <div className="footer-logo">
            <img src={logoImg} alt="Logo" className="footer-logo-img" />
            <p>Айболит - ветеринарная клиника</p>
          </div>
          <div className="footer-column">
            <h4>Покупка</h4>
            <a href="/write">Консультация в онлайне</a>
          </div>
          <div className="footer-column">
            <h4>Услуги и цены</h4>
            <a href="/history">История компании</a>
            <a href="/collective">Наши специалисты</a>
            <a href="/write">Онлайн-оплата</a>
          </div>
          <div className="footer-column">
            <h4>Отзывы</h4>
            <a href="/contacts">Контакты</a>
            <a href="/blog">Блог</a>
          </div>
        </div>
        <div className="footer-bottom">
          <div className="footer-contact">
            <p>aibolit34.ru</p>
            <p>aibolit34@gmail.com</p>
          </div>
        </div>
        <p className="footer-signature">Made with ❤️ UnitBean</p>
      </footer>
    </div>
  );
}

export default HomePage;